tap "heroku/brew"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"
tap "homebrew/services"
tap "koekeishiya/formulae"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# SSL/TLS cryptography library
brew "openssl"
# Library for manipulating PNG images
brew "libpng"
# Software library to render fonts
brew "freetype"
# XML-based font configuration API for X Windows
brew "fontconfig"
# Library for command-line editing
brew "readline"
# Interpreted, interactive, object-oriented programming language
brew "python"
# Formatting tools for C, C++, Obj-C, Java, JavaScript, TypeScript
brew "clang-format"
# ASP system to ground and solve logic programs
brew "clingo", link: false
# Statistics utility to count lines of code
brew "cloc"
# Cross-platform make
brew "cmake"
# Proof assistant for higher-order logic
brew "coq"
# GNU multiple precision arithmetic library
brew "gmp"
# Asynchronous event library
brew "libevent"
# YAML Parser
brew "libyaml"
# Next-gen compiler infrastructure
brew "llvm"
# Manage compile and link flags for libraries
brew "pkg-config"
# Fast and statically typed, compiled language with Ruby-like syntax
brew "crystal"
# Programming language for highly scalable real-time systems
brew "erlang"
# Functional metaprogramming aware language built on Erlang VM
brew "elixir"
# Modern replacement for 'ls'
brew "exa"
# Command-line tool to interact with exercism.io
brew "exercism"
# GNU compiler collection
brew "gcc"
# GNU debugger
brew "gdb"
# OpenType text shaping engine
brew "harfbuzz"
# Cross-platform application and UI framework
brew "qt"
# Command-driven, interactive function plotting
brew "gnuplot"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Command-line hex viewer
brew "hexyl"
# Convert source code to formatted text with syntax highlighting
brew "highlight"
# Tools and libraries to manipulate images in many formats
brew "imagemagick"
# Graphical front-end for GCC's coverage testing tool (gcov)
brew "lcov"
# Next-gen compiler infrastructure
brew "llvm"
# Keep your Mac's application settings in sync
brew "mackup"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Package for scientific computing with Python
brew "numpy", link: false
# Manage multiple Node.js versions
brew "nvm"
# Swiss-army knife of markup format conversion
brew "pandoc"
# Static analysis and lint tool, for (ba)sh scripts
brew "shellcheck"
# ISO/Edinburgh-style Prolog interpreter
brew "swi-prolog"
# Terminal multiplexer
brew "tmux"
# Internet file retriever
brew "wget"
# The next-generation plugin manager for zsh
brew "zplug"
# UNIX shell (command interpreter)
brew "zsh"
# Everything you need to get started with Heroku
brew "heroku/brew/heroku"
# Tiling window manager for macOS based on plugin architecture
brew "koekeishiya/formulae/chunkwm"
# Simple hotkey-daemon for macOS.
brew "koekeishiya/formulae/skhd"
cask "alacritty"
cask "brooklyn"
cask "qutebrowser"
